Revit 2027 API
RebarCoupler.CouplerMark Property
 gets and sets the coupler mark
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CouplerMark { get; set; }
Public Property CouplerMark As String
	Get
	Set
public:
property String^ CouplerMark {
	String^ get ();
	void set (String^ value);
}
member CouplerMark : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace